import React from "react";
import styles from "./OurMission.module.css";

const OurMissions = () => {
  const scrollToSection = () => {
    const element = document.getElementById("FreeConsultation");
    if (element) {
      window.scrollTo({ top: element.offsetTop, behavior: "smooth" });
    }
  };
  return (
    <div id="ourMission" className={`${styles.ourMissions}`}>
      <div className={`${styles.ourMissionsUpBlock} ${styles.blockSqueare}`}>
        <div className={`${styles.ourMissionsText}`}>
          <b>Наша миссия</b>
        </div>
        <div className={`${styles.ourMissionsUpBlockText}`}>
          <span className={`${styles.ourMissionsOrangeText}`}>
            Создавать безопасные и качественные дороги,
          </span>{" "}
          которые обеспечивают комфортное передвижение и долгосрочную
          эксплуатацию.
        </div>
      </div>
      <div className={`${styles.ourMissionsCenterBlock}`}>
        <div
          className={`${styles.ourMissionsCenterBlockQuality} ${styles.blockSqueare} ${styles.ourMissionsCenterBlockCenterSqueares}`}
        >
          <div className={`${styles.ourMissionsCenterBlockSvg}`}>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="54"
              height="43"
              viewBox="0 0 54 43"
              fill="none"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M51.85 13.3759L49.225 10.7509C47.9741 9.48586 46.2787 8.75926 44.5 8.72588H34.5V7.27588C34.5 3.47892 31.422 0.400879 27.625 0.400879H7C5.96447 0.400879 5.125 1.24034 5.125 2.27588C5.125 3.31141 5.96447 4.15088 7 4.15088H27.55C29.2759 4.15088 30.675 5.54999 30.675 7.27588V23.1009C30.675 24.1364 31.5145 24.9759 32.55 24.9759C33.5855 24.9759 34.425 24.1364 34.425 23.1009V12.4759H44.425C45.2535 12.4726 46.0477 12.8065 46.625 13.4009L49.25 15.9009C49.608 16.272 49.866 16.7279 50 17.2259H39.5C38.4645 17.2259 37.625 18.0653 37.625 19.1009C37.625 20.1364 38.4645 20.9759 39.5 20.9759H50.125V31.6009C50.159 32.4511 49.8449 33.2785 49.2551 33.8918C48.6653 34.5052 47.8509 34.8516 47 34.8509H44.225C43.6098 31.9664 41.0618 29.9047 38.1125 29.9047C35.1632 29.9047 32.6152 31.9664 32 34.8509H18.65C17.9771 31.8694 15.2318 29.8231 12.1823 30.03C9.13287 30.237 6.68917 32.6354 6.42527 35.6805C6.16136 38.7255 8.15599 41.5086 11.1244 42.2371C14.0928 42.9656 17.1492 41.4221 18.325 38.6009H32.35C33.3245 40.9214 35.5957 42.4309 38.1125 42.4309C40.6293 42.4309 42.9005 40.9214 43.875 38.6009H47C50.797 38.6009 53.875 35.5228 53.875 31.7259V18.2509C53.8784 16.4206 53.1492 14.6651 51.85 13.3759ZM12.55 38.2009C11.7107 38.2418 10.9314 37.7664 10.5838 37.0014C10.2361 36.2363 10.3906 35.3366 10.9735 34.7313C11.5563 34.1261 12.4496 33.9378 13.2272 34.2563C14.0048 34.5748 14.5093 35.3356 14.5 36.1759C14.5007 37.2656 13.639 38.1605 12.55 38.2009ZM36.2038 36.9295C36.5196 37.6986 37.2686 38.2008 38.1 38.2009C39.2225 38.201 40.1363 37.2983 40.15 36.1759C40.1601 35.3445 39.6672 34.5894 38.902 34.2642C38.1368 33.939 37.251 34.1082 36.6595 34.6924C36.068 35.2767 35.888 36.1604 36.2038 36.9295Z"
                fill="white"
              />
              <path
                d="M23.875 14.5009C23.8615 13.471 23.0299 12.6393 22 12.6259H2C0.964466 12.6259 0.125 13.4653 0.125 14.5009C0.125 15.5364 0.964466 16.3759 2 16.3759H22C23.0299 16.3624 23.8615 15.5308 23.875 14.5009Z"
                fill="white"
              />
              <path
                d="M22 20.1259H9.5C8.46447 20.1259 7.625 20.9653 7.625 22.0009C7.625 23.0364 8.46447 23.8759 9.5 23.8759H22C23.0355 23.8759 23.875 23.0364 23.875 22.0009C23.875 20.9653 23.0355 20.1259 22 20.1259Z"
                fill="white"
              />
            </svg>
          </div>
          <div className={`${styles.ourMissionsCenterBlockText}`}>
            <div className={`${styles.ourMissionsCenterBlockTextTitle}`}>
              Качество и надежность
            </div>
            <div>
              Стремимся к созданию прочных и долговечных дорожных покрытий,
              которые выдержат любые нагрузки
            </div>
          </div>
        </div>
        <div
          className={`${styles.ourMissionsCenterBlockResponsibility} ${styles.blockSqueare} ${styles.ourMissionsCenterBlockCenterSqueares}`}
        >
          <div className={`${styles.ourMissionsCenterBlockSvg}`}>
            <svg
              width="51"
              height="46"
              viewBox="0 0 51 46"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M50.0109 29.8493L50.3609 31.5743C50.742 33.0479 50.4312 34.6149 49.5164 35.8314C48.6015 37.0479 47.1824 37.7815 45.6609 37.8243H36.1359C36.1382 41.8708 32.9301 45.1894 28.8859 45.3243H8.16091C5.87225 45.2864 3.72621 44.2054 2.33343 42.3889C0.940646 40.5725 0.453611 38.2194 1.01091 35.9993L1.53591 33.4993C2.14637 30.0554 5.11375 27.5284 8.61091 27.4743H28.4609C29.3468 26.4155 30.6554 25.8024 32.0359 25.7993H45.2609C47.596 25.8738 49.5682 27.5554 50.0109 29.8493ZM45.6109 34.0493C45.9159 34.038 46.2 33.8914 46.3859 33.6493C46.7129 33.3194 46.8776 32.862 46.8359 32.3993L46.4859 30.6743C46.4182 30.1155 45.9711 29.6789 45.4109 29.6243H32.1859C31.8982 29.6262 31.6287 29.7656 31.4609 29.9993C30.744 30.825 29.7043 31.2992 28.6109 31.2993H8.7609C7.04944 31.341 5.61537 32.6064 5.3609 34.2993L4.8359 36.7993C4.57949 38.0306 4.88158 39.3122 5.6609 40.2993C6.26966 41.0671 7.182 41.5323 8.1609 41.5743H28.8109C30.8229 41.4407 32.3691 39.7399 32.3109 37.7243C32.3517 35.6826 34.0188 34.0489 36.0609 34.0493H45.6109Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M28.4109 12.9993C28.4109 18.5222 23.9337 22.9993 18.4109 22.9993C12.8881 22.9993 8.4109 18.5222 8.4109 12.9993V9.07432C8.4109 4.43512 12.1717 0.674316 16.8109 0.674316H20.0859C24.6958 0.715478 28.4111 4.46426 28.4109 9.07432V12.9993ZM16.8109 4.42432C14.2428 4.42432 12.1609 6.50619 12.1609 9.07431L12.2359 12.9993C12.6349 16.1472 15.3128 18.5072 18.4859 18.5072C21.659 18.5072 24.3369 16.1472 24.7359 12.9993V9.07431C24.7359 6.50619 22.654 4.42432 20.0859 4.42432H16.8109Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M47.3609 13.6243C47.3609 17.7665 44.003 21.1243 39.8609 21.1243C35.7188 21.1243 32.3609 17.7665 32.3609 13.6243V10.7493C32.3605 7.3086 35.1206 4.50393 38.5609 4.44932H41.0609C44.5403 4.44932 47.3609 7.26992 47.3609 10.7493V13.6243ZM38.6109 8.24932C37.2302 8.24932 36.1109 9.3686 36.1109 10.7493V13.6243C36.1109 15.6954 37.7898 17.3743 39.8609 17.3743C41.932 17.3743 43.6109 15.6954 43.6109 13.6243V10.7493C43.6109 9.3686 42.4916 8.24932 41.1109 8.24932H38.6109Z"
                fill="white"
              />
            </svg>
          </div>
          <div className={`${styles.ourMissionsCenterBlockText}`}>
            <div className={`${styles.ourMissionsCenterBlockTextTitle}`}>
              ответственность
            </div>
            <div>
              Соблюдаем все стандарты безопастности и экологии, заботимся о
              минимизации воздействия на окружающую среду.
            </div>
          </div>
        </div>
        <div
          className={`${styles.ourMissionsCenterBlockInnovation} ${styles.blockSqueare} ${styles.ourMissionsCenterBlockCenterSqueares}`}
        >
          <div className={`${styles.ourMissionsCenterBlockSvg}`}>
            <svg
              width="51"
              height="50"
              viewBox="0 0 51 50"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M9.85975 0.000488281H40.8121C46.072 0.000488281 50.3359 4.26444 50.3359 9.5243V40.4767C50.3359 45.7365 46.072 50.0005 40.8121 50.0005H9.85975C4.59989 50.0005 0.335938 45.7365 0.335938 40.4767V9.5243C0.335938 4.26444 4.59989 0.000488281 9.85975 0.000488281ZM40.8121 46.4291C44.0995 46.4291 46.7645 43.7641 46.7645 40.4767V9.5243C46.7645 6.23689 44.0995 3.57192 40.8121 3.57192H9.85974C6.57234 3.57192 3.90736 6.23689 3.90736 9.5243V40.4767C3.90736 43.7641 6.57234 46.4291 9.85974 46.4291H40.8121Z"
                fill="white"
              />
              <path
                d="M38.4312 17.2624H31.2883C30.3021 17.2624 29.5026 18.0619 29.5026 19.0481C29.5026 20.0343 30.3021 20.8338 31.2883 20.8338H33.5026L25.0264 29.31L20.2645 24.5481C19.0009 23.2888 16.9567 23.2888 15.6931 24.5481L9.4788 30.5719C8.78248 31.2691 8.78248 32.3985 9.4788 33.0957C9.81185 33.433 10.2667 33.6218 10.7407 33.6195C11.2152 33.6245 11.6711 33.4353 12.0026 33.0957L17.8836 27.2148L22.6455 31.9767C23.9173 33.2387 25.9689 33.2387 27.2407 31.9767L36.5502 22.6672V26.191C36.5502 27.1772 37.3497 27.9767 38.3359 27.9767C39.3222 27.9767 40.1216 27.1772 40.1216 26.191V19.0481C40.1113 18.1026 39.3747 17.3245 38.4312 17.2624Z"
                fill="white"
              />
            </svg>
          </div>
          <div className={`${styles.ourMissionsCenterBlockText}`}>
            <div className={`${styles.ourMissionsCenterBlockTextTitle}`}>
              инновации
            </div>
            <div>
              Используем передовые технологии и материалы для оптимизации
              процессов и повышения к ачества.
            </div>
          </div>
        </div>
      </div>
      <div className={`${styles.ourMissionsDownBlock} ${styles.blockSqueare}`}>
        <div className={`${styles.ourMissionsText}`}>
          <b>О нас</b>
        </div>
        <div className={`${styles.ourMissionsUpBlockText}`}>
          С 2019 года мы создаем надежные дороги, прочные тротуары и выполняем
          комплексную реконструкцию дорожной инфраструктуры.
          <span className={`${styles.ourMissionsOrangeText}`}>
            {" "}
            Мы не просто строим дороги — мы создаем пути в будущее!
          </span>
        </div>
      </div>
      <a
        onClick={scrollToSection}
        className={`${styles.ourMissionsCenterBlockButtonCall} cursor-pointer`}
      >
        Заказать звонок
      </a>
    </div>
  );
};

export default OurMissions;
